# SQL Practice: Business Questions and Raw SQL Queries

This notebook is designed to help you practice SQL for real business scenarios. You will connect to your database, create example tables, insert data, and answer business questions using raw SQL queries.

In [14]:
# Set Up Database Connection
from sqlalchemy import create_engine, text
import pandas as pd

# Update the connection string as needed for your environment
engine = create_engine('mysql+mysqldb://root:root7623@localhost:3306/logistics_db')

# Test connection
with engine.connect() as conn:
    result = conn.execute(text('SELECT 1'))
    print('Database connection successful:', result.scalar() == 1)

Database connection successful: True

## Create Example Tables and Insert Data

The following cells create example tables and insert sample data for practice.

In [15]:
# Create tables and insert sample data (with cleanup and reset)
with engine.begin() as conn:
    conn.execute(text('''
    SET FOREIGN_KEY_CHECKS = 0;
    TRUNCATE TABLE order_items;
    TRUNCATE TABLE orders;
    TRUNCATE TABLE products;
    TRUNCATE TABLE customers;
    SET FOREIGN_KEY_CHECKS = 1;
    '''))
    conn.execute(text('''
    INSERT INTO customers (name, email) VALUES
        ('Alice', 'alice@example.com'),
        ('Bob', 'bob@example.com'),
        ('Carol', 'carol@example.com');
    INSERT INTO products (name, price) VALUES
        ('Widget', 10.00),
        ('Gadget', 20.00),
        ('Thingamajig', 15.00);
    INSERT INTO orders (customer_id, order_date) VALUES
        (1, '2025-09-01'),
        (2, '2025-09-02'),
        (1, '2025-09-03');
    INSERT INTO order_items (order_id, product_id, quantity) VALUES
        (1, 1, 2),
        (1, 2, 1),
        (2, 2, 3),
        (3, 3, 5);
    '''))
print('Sample tables and data created.')

Sample tables and data created.

## Business Question 1: Total Sales by Product

What is the total sales amount for each product?

In [16]:
# Raw SQL: Total sales by product
query = '''
SELECT p.name AS product, SUM(oi.quantity * p.price) AS total_sales
FROM order_items oi
JOIN products p ON oi.product_id = p.id
GROUP BY p.id, p.name
ORDER BY total_sales DESC;
'''
df = pd.read_sql(query, engine)
df

       product  total_sales
0       Gadget         80.0
1  Thingamajig         75.0
2       Widget         20.0

## Business Question 2: Top 5 Customers by Revenue

Who are the top 5 customers who have generated the most revenue?

In [8]:
# Raw SQL: Top 5 customers by revenue
query = '''
SELECT c.name AS customer, SUM(oi.quantity * p.price) AS revenue
FROM customers c
JOIN orders o ON c.id = o.customer_id
JOIN order_items oi ON o.id = oi.order_id
JOIN products p ON oi.product_id = p.id
GROUP BY c.id, c.name
ORDER BY revenue DESC
LIMIT 5;
'''
df = pd.read_sql(query, engine)
df

  customer  revenue
0    Alice    115.0
1      Bob     60.0

## Business Question 3: Monthly Sales Trend

What is the total sales amount for each month?

In [10]:
# Raw SQL: Monthly sales trend
query = """
SELECT DATE_FORMAT(o.order_date, '%%Y-%%m') AS month, SUM(oi.quantity * p.price) AS total_sales
FROM orders o
JOIN order_items oi ON o.id = oi.order_id
JOIN products p ON oi.product_id = p.id
GROUP BY month
ORDER BY month;
"""
df = pd.read_sql(query, engine)
df

     month  total_sales
0  2025-09        175.0

## Business Question 4: Products Never Sold

Which products have never been sold?

In [11]:
# Raw SQL: Products never sold
query = '''
SELECT p.name AS product
FROM products p
LEFT JOIN order_items oi ON p.id = oi.product_id
WHERE oi.id IS NULL;
'''
df = pd.read_sql(query, engine)
df

Empty DataFrame
Columns: [product]
Index: []

## Business Question 5: Average Order Value

What is the average value of all orders?

In [12]:
# Raw SQL: Average order value
query = '''
SELECT AVG(order_total) AS avg_order_value
FROM (
    SELECT o.id, SUM(oi.quantity * p.price) AS order_total
    FROM orders o
    JOIN order_items oi ON o.id = oi.order_id
    JOIN products p ON oi.product_id = p.id
    GROUP BY o.id
) sub;
'''
df = pd.read_sql(query, engine)
df

   avg_order_value
0        58.333333